In [1]:
import numpy as np
import pandas as pd

# Series Objects

In [3]:
data= pd.Series([8.2,1.5,5.6,4])
data

0    8.2
1    1.5
2    5.6
3    4.0
dtype: float64

In [4]:
data.values

array([8.2, 1.5, 5.6, 4. ])

In [12]:
data= pd.Series([5,6,83,91])
data

0     5
1     6
2    83
3    91
dtype: int64

In [13]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
data[5:20]

Series([], dtype: int64)

In [20]:
data= pd.Series([23,44,65,12], index=['a','c','e','f'])
data

a    23
c    44
e    65
f    12
dtype: int64

In [22]:
data= pd.Series([-2.56,6.1,8.3,9.2],index=[1,2,3,4])
data

1   -2.56
2    6.10
3    8.30
4    9.20
dtype: float64

In [26]:
book_id={'science':234,
        'sociology':811,
        'polity':127,
        'accounts':974,
        'zoology':412}
id= pd.Series(book_id)
id

science      234
sociology    811
polity       127
accounts     974
zoology      412
dtype: int64

In [25]:
id['polity']

127

In [27]:
id['sociology':'zoology']

sociology    811
polity       127
accounts     974
zoology      412
dtype: int64

In [32]:
population_dict={'california':8236781,
                'texas':4536727,
                'new york':7567382,
                'Illinois':7689467,
                'Florida':6765321}
population= pd.Series(population_dict)
population

california    8236781
texas         4536727
new york      7567382
Illinois      7689467
Florida       6765321
dtype: int64

# DataFrame Object

In [30]:
area_dict={'california':4523,
                'texas':5723,
                'new york':7834,
                'Illinois':9398,
                'Florida':6743}
area=pd.Series(area_dict)
area

california    4523
texas         5723
new york      7834
Illinois      9398
Florida       6743
dtype: int64

In [33]:
states = pd.DataFrame({'population':population,'area':area})
states

            population  area
california     8236781  4523
texas          4536727  5723
new york       7567382  7834
Illinois       7689467  9398
Florida        6765321  6743

In [35]:
states.columns

Index(['population', 'area'], dtype='object')

In [36]:
states.index

Index(['california', 'texas', 'new york', 'Illinois', 'Florida'], dtype='object')

In [37]:
states['population']

california    8236781
texas         4536727
new york      7567382
Illinois      7689467
Florida       6765321
Name: population, dtype: int64

In [40]:
pd.DataFrame(np.random.rand(3,3),
            columns=['ab','bc','cd'],
            index=[1,2,3])

         ab        bc        cd
1  0.273371  0.848935  0.943953
2  0.694061  0.453177  0.900440
3  0.282948  0.714110  0.984971

In [55]:
population /area

california    1821.087995
texas          792.718330
new york       965.966556
Illinois       818.202490
Florida       1003.310248
dtype: float64

In [44]:
rng=np.random.RandomState(50)
A=rng.randint(15,size=(3,3))
A

array([[ 0,  0, 11],
       [13,  1, 14],
       [ 4,  6,  5]])

In [57]:
data.keys

<bound method Series.keys of 1   -2.56
2    6.10
3    8.30
4    9.20
dtype: float64>

# DataFrame as Dictionary

In [64]:
pop= pd.Series({'california':236781,'texas':4536727, 'new york':567382,'Illinois':7689467, 'Florida':6765321})
area=pd.Series({'california':4523,'texas':5723,'new york':7834,'Illinois':9398,'Florida':6743})
data=pd.DataFrame({'pop':pop,'area':area})
data

                pop  area
california   236781  4523
texas       4536727  5723
new york     567382  7834
Illinois    7689467  9398
Florida     6765321  6743

In [65]:
data['density']=data['pop']/data['area']
data

                pop  area      density
california   236781  4523    52.350431
texas       4536727  5723   792.718330
new york     567382  7834    72.425581
Illinois    7689467  9398   818.202490
Florida     6765321  6743  1003.310248

In [66]:
data.T

,california,texas,new york,Illinois,Florida
pop,236781.000000,4.536727e+06,567382.000000,7.689467e+06,6.765321e+06
area,4523.000000,5.723000e+03,7834.000000,9.398000e+03,6.743000e+03
density,52.350431,7.927183e+02,72.425581,8.182025e+02,1.003310e+03

In [67]:
data[data.density>100]

              pop  area      density
texas     4536727  5723   792.718330
Illinois  7689467  9398   818.202490
Florida   6765321  6743  1003.310248